//--------------------------------------
//データの管理クラス
//林海斗
//--------------------------------------
#include "data.h"
//--------------------------------------------
//コンストラクタ
//--------------------------------------------
CData::CData()
{
	m_fScore = 0.0f;
	m_fTargetScore = 0.0f;
	m_bNowGame = false;
	m_fSandRemaining = 300.0f;
}
//--------------------------------------------
//デストラクタ
//--------------------------------------------
CData::~CData()
{

}

void CData::ResetData()
{
	m_fScore = 0.0f;
	m_fTargetScore = 0.0f;
	m_bNowGame = false;
	m_fSandRemaining = 300.0f;
}